---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetDiagramSettings
source: html/4da4bb7d-8e9a-ac26-0574-dd65188c4374.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetDiagramSettings Method

Get diagram settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayDiagramSettings GetDiagramSettings()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - diagram settings were not created with the object.